Revit 2026 API

# Field Class

---

The description of a field within a Schema in the Extensible Storage framework. Contains the field's name, type, access control and documentation.

SystemObject Autodesk.Revit.DB.ExtensibleStorageField

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Field : IDisposable
```
```vb
Public Class Field
	Implements IDisposable
```
```cpp
public ref class Field : IDisposable
```
```fsharp
type Field =
    class
        interface IDisposable
    end
```

The Field type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ContainerType | Reports whether this is a simple field containing one value, or a container of multiple values. |
|  | Documentation | The overall description of the Field. |
|  | FieldName | The name of the field. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | KeyType | The type of the keys stored in the field. |
|  | Schema | The Schema to which this Field belongs. |
|  | SubSchema | The Schema describing the subentity (or subentities) stored in this Field. |
|  | SubSchemaGUID | The GUID of the Schema describing the subentity (or subentities) stored in this Field. |
|  | ValueType | The type of the values stored in the field. |

|  | Name | Description |
| --- | --- | --- |
|  | CompatibleUnit | Checks if the specified unit is compatible with the field description. |
|  | Dispose | Releases all resources used by the Field |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSpecTypeId | Gets the spec describing the values stored in this field. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SubEntityReadAccessGranted | Checks whether there is read access to subentities storable in this field. |
|  | SubEntityWriteAccessGranted | Checks whether there is write access to subentities storable in this field. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.ExtensibleStorage Namespace